tocache/Microchip-PIC18F4550/UPC Microcontroladores 2019-2/Semana 9/el57_noobster_c.X/newmain4.c
/*Este es un comentario*/
//Este es otro comentario

//Declaracion de los bits de configuracion
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config FOSC = XTPLL_XT  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)

#include <xc.h>
#define _XTAL_FREQ 48000000UL   //Para que el compilador sepa la frecuencia de trabajo

unsigned char modo = 0;

int parpadeo(void){
    LATDbits.LD0 = 1;
    __delay_ms(100);
    LATDbits.LD0 = 0;
    __delay_ms(100);
}

int parpadeo_l(void){
    LATDbits.LD0 = 1;
    __delay_ms(300);
    LATDbits.LD0 = 0;
    __delay_ms(300);
}

int encendido(void){
    LATDbits.LD0 = 1;
}

int apagao(void){
    LATDbits.LD0 = 0;
}

void main(void){
    TRISDbits.TRISD0 = 0;       //RD0 como salida
    INTCONbits.GIE = 1;         //Habilitado interruptor global de interrupciones
    INTCONbits.INT0E = 1;       //Habilitado interrupcion INT0
    while(1){
        switch(modo){
            case 0:
                apagao();
                break;
            case 1:
                parpadeo();
                break;
            case 2:
                parpadeo_l();
                break;
            case 3:
                encendido();
                break;
        }
    }
}

void __interrupt (high_priority) Int0ISR(void){
    __delay_ms(150);                //Antirrebote
    if(modo == 3){
        modo = 0;
    }
    else{
        modo++;
    }
    INTCONbits.INT0IF = 0;
}